{
  "Great Library":{
    "class_":"normal",
    "number":0,
    "rooms":{

      "Main Room":{
        "description":"The library is enormous, its massive, vaulted ceiling spans over endless rows of 20 ft. tall bookcases. The walls are filled with more books and paths in the grid-like layout, leading to an open space. A central stairway spans upward toward an office, and two smaller stairways on either side descend into the basement. There's a sign pointing north labeled 'Bathroom'.",
        "entrances":{
          "east":"Elevator Hall",
          "upstairs":"Basement",
          "downstairs":"Office",
          "south":"Bathroom"
        },
        "exits":{
          "west":"Elevator Hall",
          "downstairs":"Basement",
          "upstairs":"Office",
          "north":"Bathroom"
        },
        "features":{
          
          "Random Book":{
            "description":"random book",
            "actions":[
                "read random book"
            ]
          }
        }
      },

      "Bathroom":{
        "description": "You're in the bathroom. There's a mirror, stall and urinal, but you don't have to go.",
        "entrances":{
          "through tunnel":"Underground",
          "north":"Main Room"
        },
        "exits":{
          "south":"Main Room"
        }
      },

      "Basement":{
        "description":"You travel down the stairs to the basement. It's decorated with a posh couch, a coffee table, and several instruments. There's a few more books here too.",
        "entrances":{
          "downstairs":"Main Room"
        },
        "exits":{
          "upstairs":"Main Room"
        },
        "features":{
          
          "Globe":{
            "description":"You spin the globe. Cool.",
            "actions":[
                "inspect"
            ]
          },
          "Piano":{
            "description":"You walk over to the piano. You can play notes by using the action PLAY followed by the notes to play, like \"play cdef\".",
            "actions":[
              "inspect"
            ],
            "hidden actions":[
              "play piano notes"
            ]
          },
          "Couch":{
            "description":"You sit on the couch. Man, sure is comfy.",
            "actions":[
              "inspect"
            ]
          },
          "Advanced Guide 1":{
            "description":"You pull the book off the shelf. It reads: \"Further understanding of how and why the hotel was creating can shed some light on how to navigate it. The more you come to understand of its purpose the more it will make sense. First and foremost, it was designed to be a maze, meant to keep something out. Hints were left to help guide those that were supposed to uncover its secrets, hints that might not be obvious to the average person... \". You put the book back.",
            "actions":[
              "inspect"
            ]
          },
          "Advanced Guide 2":{
            "description":"You pull the book off the shelf. It reads: \"The primary 'currency' of the hotel is knowledge. It's the most important key you can have and certain knowledge rumored to be the hotel's greatest treasure. Of course, such a great treasure is sought out by many. You should work together and exchange knowledge with other explores to help both of you on your journeys. There is something else in the hotel that's searching for its treasure, or any information that would help in finding it. Hope that it doesn't find the treasure or you before you're able to escape.\". You put the book back.",
            "actions":[
              "inspect"
            ]
          },
          "Advanced Guide 3":{
            "description":"You pull the book off the shelf. It reads: \"Any mundane item or object could be a part of a larger puzzle. Never underestimate saying the right thing at the right time. *These puzzles are mostly predicated on information you should already be familiar with*. Try numbers and phrases that might be important, and pay special attention to objects and symbols you might be familiar with from life outside of the hotel\". You put the book back.",
            "actions":[
              "inspect"
            ]
          },
          "Advanced Guide 4":{
            "description":"You pull the book off the shelf. It reads: \"If you're stuck or bored, return to the library basement (floor 0) and look for hints or other floor numbers that might be helpful\". You put the book back.",
            "actions":[
              "inspect"
            ]
          },
          "Advanced Guide 5":{
            "description":"You try to pull the book off the shelf. You got it some of the way out, but it seems stuck.",
            "actions":[
              "inspect"
            ],
            "hidden actions":[
              "pull advanced guide 5"
            ]
          }
        }
      },

      "Underground":{
        "description":"You're in a dark cement room. You can barely make out a tunnel on the other side of the room. Looks cramped.",
        "exit message":"You wiggle your way through the tight tunnel, which leads to a utility ladder. You climb up the metal rungs and pop your head through a hatch. As you climb out of the tunnel, the hatch closes behind you.",
        "entrances":{
        },
        "exits":{
          "through tunnel":"Bathroom"
        },
        "items":{
          "Treasure Map":{
            "description":"It's a guide to treasure! It reads: \"you gotta go find a big run down house, should have a few floors, anyways go to the basement then the courtyard then type 'shovel' (without the single quotes, obviously). once you have the shovel, go find the creek, follow the creek and when it splits, go northeast, and follow that to the end, where you should dig with the shovel. come back here to the library (floor 0), and swing the thing you found buried in the creek in the main room.\""
          }
        }
      },

      "Office":{
        "description":"You enter a small office. There's a desk with a swivel chair, and a few notes left on it. A medal lays on the other side of the desk.",
        "entrances":{
        },
        "exits":{
          "downstairs":"Main Room"
        },
        "features":{
          "Note 1":{
            "description":"It's a note left for you. It reads: \"yo how's it going. you did a bunch of stuff to get here so im gonna assume you've enjoyed it enough to stick with it for a bit. real cool stuff. anyways, glad you can follow directions. you might wonder 'is there an endgame to all this? is there a point or ending?' in which case sheesh. relax. one step at a time. im not gonna spoil everything, but you might have some luck if you can find the vault floor. its a floor with a bunch of locked vault doors. this is a lot to read so ill split it up in a few notes.\"",
            "actions":[
              "inspect"
            ]
          },
          "Note 2":{
            "description":"Note 2: \"so speaking of the vault doors, each door has a 4 digit pin associated with it, and there's 7 different tasks you need to do to get the pins. once you have a pin, the vault should tell you which pin it wants, you can unlock that door and go to the next room. you gotta unlock the doors in order. also, you're definitely gonna need to start working with other people, because if they pick up a piece of some puzzle and lose it you're hosed. other people may have seen one of the pins already and can save you all time. one more note then im done i swear.\"",
            "actions":[
              "inspect"
            ]
          },
          "Note 3":{
            "description":"Note 3: \"obviously if you open all 7 doors there's something at the end. ill go ahead and give you the first code. its in the room, just inspect the medal. that pin should open the first door.\"",
            "actions":[
              "inspect"
            ]
          },
          "Medal":{
            "description":"It's a gold medal with a teardrop shape on it. On the back is written \"ABILITY:6430\".",
            "action":[
              "inspect"
            ]
          }
          
        }
      },

      "Elevator Hall":{
        "description":"You enter the elevator hallway.",
        "entrances":{
          "east":"Elevator",
          "west":"Main Room"
        },
        "exits":{
          "west":"Elevator",
          "east":"Main Room"
        }
      }
    }
  },

  "First Floor and Lobby" : {
    "class_":"normal",
    "number":1,
    "rooms":{

      "Main Hall":{
        "description":"You're in a small hallway. There's a bunch of numbered hotel rooms, and at the east end there is a large lobby with a handful of ammenities. At the west end, a mysterious elevator. There's a dial above the elevator to indicate what floor the elevator is on. On one end of the dial has a 0, the other has an infinity symbol.",
        "entrances":{
          "west":"Lobby",
          "east" : "Elevator",
          "out room 1":"Room 1",
          "out room 2":"Room 2",
          "out room 3":"Room 3",
          "out room 4":"Room 4",
          "out room 5":"Room 5",
          "out room 6":"Room 6"
        },
        "exits":{
          "to room 1":"Room 1",
          "to room 2":"Room 2",
          "to room 3":"Room 3",
          "to room 4":"Room 4",
          "to room 5":"Room 5",
          "to room 6":"Room 6",
          "west" : "Elevator",
          "east":"Lobby"
        }
      },

      "Room 1":{
        "description":"It's a hotel room furnished with a bed, nightstand, and lamp. Funny, there's no windows...",
        "entrances":{
          "to room 1":"Main Hall"
        },
        "exits":{
          "out room 1":"Main Hall"
        }
      },

      "Room 2":{
        "description":"It's a hotel room furnished with a bed, nightstand, and lamp. Funny, there's no windows...",
        "entrances":{
          "to room 2":"Main Hall"
        },
        "exits":{
          "out room 2":"Main Hall"
        }
      },

      "Room 3":{
        "description":"It's a hotel room furnished with a bed, nightstand, and lamp. Funny, there's no windows...",
        "entrances":{
          "to room 3":"Main Hall"
        },
        "exits":{
          "out room 3":"Main Hall"
        }
      },

      "Room 4":{
        "description":"It's a hotel room furnished with a bed, nightstand, and lamp. Funny, there's no windows...",
        "entrances":{
          "to room 4":"Main Hall"
        },
        "exits":{
          "out room 4":"Main Hall"
        }
      },

      "Room 5":{
        "description":"It's a hotel room furnished with a bed, nightstand, and lamp. Funny, there's no windows...",
        "entrances":{
          "to room 5":"Main Hall"
        },
        "exits":{
          "out room 5":"Main Hall"
        }
      },
      "Room 6":{
        "description":"It's a hotel room furnished with a bed, nightstand, and lamp. Funny, there's no windows...",
        "entrances":{
          "to room 6":"Main Hall"
        },
        "exits":{
          "out room 6":"Main Hall"
        }
      },

      "Lobby":{
        "description":"You're in the Infinite Hotel's Lobby.",
        "entrances":{
          "east":"Main Hall"
        },
        "exits":{
          "west":"Main Hall"
        },
        "features":{
          "Guide":{
            "description":"You pull the book \"Infinite Hotel Guide\" off the shelf. The contents can be read at https://github.com/tylersverak/InfiniteHotel/blob/main/README.md.",
            "actions":[
                "inspect"
            ]
          }
        }
      }
    }
  },

  "Mirror Room":{
    "class_":"normal",
    "number":2,
    "rooms":{

      "Main Room":{
        "description":"You're in a large room with a high ceiling. You notice an old TV, oil painting, and a blackboard covered in an arrangement of bizarre marks and symbols. The far wall of the room is a mirror and makes the room look twice as big. Something seems to be off about the reflection...",
        "entrances":{
          "east":"Elevator Hall"
        },
        "exits":{
          "west":"Elevator Hall"
        },
        "features":{
          
          "Oil Painting":{
            "description":"An oil painting of yellow, red, and black decorates the wall behind you. In the reflection, you notice the design and texture indicate it's a watercolor painting. Both paintings radiate a tense aura.",
            "actions":[
                "inspect"
            ]
          },
          "Blackboard":{
            "description":"You flip the blackboard around in its frame and look in the mirror. In the reflection, there are no stray marks, and a message is written in clear, plain text: \"SPIRITS:5007\". When you flip the blackboard back around, you notice the symbols are still there.",
            "actions":[
                "inspect"
            ]
          },
          "Mirror":{
            "description":"You walk closer to the mirror and look your reflection in the eyes. As you lock gaze, you watch as they blink...",
            "actions":[
              "inspect"
            ]
          },
          "TV":{
            "description":"You walk over to the TV and turn it on. Interestingly, the TV in the reflection is playing a different channel. After a few seconds, the TV flashes and shuts off.",
            "actions":[
                "inspect"
            ]
          }
        }
      },

      "Elevator Hall":{
        "description":"You enter the elevator hallway.",
        "entrances":{
          "east":"Elevator",
          "west":"Main Room"
        },
        "exits":{
          "west":"Elevator",
          "east":"Main Room"
        }
      }
    }
  },
  
  "Laszewo Floor" : {
      "class_":"normal",
      "number":3,
      "rooms":{
        "Elevator Hall":{
          "description":"You enter the elevator hallway.",
          "entrances":{
            "east":"Elevator",
            "west":"Main Hall"
          },
          "exits":{
            "west":"Elevator",
            "east":"Main Hall"
          }
        },

        "Main Hall":{
            "description":"You're in a beautiful gallery, laid out like a museum. Paintings are hung on either wall, each with their own title, and an emblem on the ground in front of you. Across the room is a circle perfectly carved into the marble wall.",
            "entrances":{
              "east":"Elevator Hall"
            },
            "exits":{
                "west":"Elevator Hall"
            },
            "features":{
              "Gold Sculpture":{
                "description":"The painting depicts a sculpture made to look like a person's head. It is made of dark stone, and the top half has been broken off. The exposed interior is a bright yellow color. Gold liquid drips from the person's lips.",
                "actions":[
                    "inspect"
                ]
              },
              "Monoliths":{
                "description":"Two marble monoliths rise from a fog of pink and blue. On each one a figure can be seen, staring at the other.",
                "actions":[
                    "inspect"
                ]
              },
              "Desert Sun":{
                "description":"A glowing red sun sits on a hill of black sand, illuminating it. Three figures can be seen walking towards it.",
                "actions":[
                    "inspect"
                ]
              },
              "Trinity Lake":{
                "description":"A lake surrounded by great mountains can be seen extending to the horizon. Three lights, two pink and one blue, illuminate the night and reflect off of the surface of the water. Three figures appear to be walking across the lake's surface towards the lights.",
                "actions":[
                    "inspect"
                ]
              },
              "Emblem":{
                "description":"An emblem of a triangle in two segments with a line perpindicularly cutting through one edge is emblazoned on the floor. Text around it reads \"Say our name - We don't know how to pronounce it either\".",
                "actions":[
                    "inspect"
                ]
              },
              "hiddenroomswitch":{
                "description":"",
                "hidden actions":[
                    "Laszewo"
                ]
              }
            }
          },

          "Laszewo Room":{
            "description":"You enter the passageway in the wall and find yourself in a hidden room. A small table holds a record player, note, and a picture.",
            "entrances":{
              "east":"Main Hall"
            },
            "exits":{
              "west":"Main Hall"
            },
            "features":{
                "Picture":{
                  "description":"It's a little blurry, but it appears to be from a music show. The triangle emblem is displayed on a bright screen, and everyone seems to be having a good time.",
                  "actions":[
                      "inspect"
                  ]
                },
                "Record Player":{
                    "description":"There's a record ready to be played. Maybe you should give it a listen.",
                    "actions":[
                        "inspect"
                    ],
                    "hidden actions":[
                        "listen to music"
                    ]
                }
              }
          }
      }
    },

    "Boat":{
      "class_":"normal",
      "number":4,
      "rooms":{

        "Main Deck":{
          "description":"As you walk out of the hall, the ground shifts beneath you. The smell of the sea is apparent, and you notice you've walked onto a boat. There are signs of life but you don't see any of the crew.",
          "entrances":{
            "east":"Elevator Hall"
          },
          "exits":{
            "west":"Elevator Hall"
          },
          "features":{
            "The Helm":{
              "description":"The boat's helm",
              "custom actions":{
                    "steer toward shore":{
                      "enabled":false,
                      "description enabled":"steer",
                      "description disabled":"not steer",
                      "hidden":false
                    }
              }
            }
          },
          "items":{
            "Fish":{
              "description":"It's a fish you found on the deck of a boat."
            }
          }
        },

        "Elevator Hall":{
          "description":"You enter the elevator hallway.",
          "entrances":{
            "east":"Elevator",
            "west":"Main Deck"
          },
          "exits":{
            "west":"Elevator",
            "east":"Main Deck"
          }
        }
      }
    },

    "Lighthouse Floor":{
      "class_":"twin",
      "twin":4,
      "number":5,
      "rooms":{

        "Entryway":{
          "description":"You enter a small, circular room. The air smells like sea water and the wooden support beams seem to be weak. Paint peels off the wall. You can see the ocean from out of the dust-covered window. It's late, and quite dark outside. A spiral staircase loops around the edge of the wall to the next story.",
          "entrances":{
            "east":"Elevator Hall",
            "downstairs":"Second Story",
            "inside":"Dock"
          },
          "exits":{
            "west":"Elevator Hall",
            "upstairs":"Second Story",
            "outside":"Dock"
          },
          "features":{
            "Journal":{
              "description":"The journal reads: \"They've been gone for two weeks now. At this point, they will have been without supplies for 8 days. My only hope is the current has pushed them to southern shores, and they must travel back by land. More likely, whatever they were after, they perished trying to find it. I hope the lamp can lead them home.\"",
              "actions":[
                  "inspect"
              ]
            },
            "Sign":{
              "description":"A sign on the wall. It says: \"Fun Fact: The lighting apparatus of a lighthouse is called a lamp (even if it's electric)!\"",
              "actions":[
                  "inspect"
              ]
            },
            "Apparatus":{
              "description":"A bizarre apparatus constructed of pipes and a long looking glass pointed at a concave indentation. It's been built around a missing piece.",
              "actions":[
                  "inspect"
              ]
            }
          }
        },

        "Dock":{
          "description":"You find yourself at a dock outside the lighthouse. The dock extends out into the sea.",
          "entrances":{
            "outside":"Entryway"
          },
          "exits":{
            "inside":"Entryway"
          }
        },

        "Boat 2":{
          "description":"The boat has come to shore and is parked at the dock.",
          "entrances":{
            "east":"Dock"
          },
          "exits":{
            "west":"Dock"
          },
          "items":{
            "Sea Orb":{
              "description":"A mysterious orb you found on a boat stranded at sea. The will of the ocean courses through it. You sense it is a smaller part of something greater.",
              "actions":[
                "orb"
              ]
            }
          }
        },

        "Second Story":{
          "description":"You arrive on the second story.",
          "entrances":{
            "downstairs":"Third Story",
            "upstairs":"Entryway"
          },
          "exits":{
            "upstairs":"Third Story",
            "downstairs":"Entryway"
          }
        },

        "Third Story":{
          "description":"You arrive on the third story.",
          "entrances":{
            "upstairs":"Second Story",
            "downstairs":"Lookout"
          },
          "exits":{
            "downstairs":"Second Story",
            "upstairs":"Lookout"
          }
        },

        "Lookout":{
          "description":"You come to the top of the lighthouse. The ocean air smells foul. You can't see much, but you can hear the waves crashing against the shore. The lamp is off.",
          "entrances":{
            "upstairs":"Third Story"
          },
          "exits":{
            "downstairs":"Third Story"
          },
          "features":{
            "Lever":{
              "description":"switch",
              "actions":[
                "flip power switch"
              ]
            }
          }
        },

        "Elevator Hall":{
          "description":"You enter the elevator hallway.",
          "entrances":{
            "east":"Elevator",
            "west":"Entryway"
          },
          "exits":{
            "west":"Elevator",
            "east":"Entryway"
          }
        }
      }
    },
    
    "Prank Room":{
      "class_":"normal",
      "number":6,
      "rooms":{

        "Main Room":{
          "description":"You walk into a small courtyard. There's a bench, a small path, and a tiny pond. In front of the pond is a small stone with the text \"FLIP ME OVER\" on it.",
          "entrances":{
            "east":"Elevator Hall"
          },
          "exits":{
            "west":"Elevator Hall"
          },
          "features":{
            "Rock":{
              "description":"You flip over the rock... on the back is written \"YOU JUST TOOK ORDERS FROM A ROCK! ARE YOU STONED?\". Guess whoever left it here got you pretty good.",
              "actions":[
                  "inspect"
              ]
            }
          }
        },

        "Elevator Hall":{
          "description":"You enter the elevator hallway.",
          "entrances":{
            "east":"Elevator",
            "west":"Main Room"
          },
          "exits":{
            "west":"Elevator",
            "east":"Main Room"
          }
        }
      }
    },

    "Slots Room":{
      "class_":"normal",
      "number":7,
      "rooms":{

        "Gambling Floor":{
          "description":"The floor is a cheap, thin red carpet. The air smells of cigarettes and cheap liquor. The walls are decorated with images of playing cards and a large red and black striped wheel. Several rows of machines, illuminated by bright colorful lights, beckon you with the sound of their bells.",
          "entrances":{
            "east":"Elevator Hall"
          },
          "exits":{
            "west":"Elevator Hall"
          },
          "features":{
            "Slot Machine":{
              "description":"A shiny machine with a lever.",
              "actions":[
                  "pull machine lever"
              ]
            }
          }
        },

        "Prize Room":{
          "description":"room for prizes",
          "entrances":{
          },
          "exits":{
          },
          "items":{
            "Lemon":{
              "description":"It's a lemon you won as a prize."
            },
            "Frying Pan":{
              "description":"It's a frying pan you won as a prize."
            }
          }
        },

        "Elevator Hall":{
          "description":"You enter the elevator hallway.",
          "entrances":{
            "east":"Elevator",
            "west":"Gambling Floor"
          },
          "exits":{
            "west":"Elevator",
            "east":"Gambling Floor"
          }
        }
      }
    },

    "Creek Floor":{
      "class_":"normal",
      "number":8,
      "rooms":{

        "Main Creek":{
          "description":"You step onto the shore of a small creek. The banks are steep, and behind the door to your west are thick bushes, blocking your way. There's a spot where you can hop to the other side of the creek.",
          "entrances":{
            "east":"Elevator Hall",
            "west":"Split"
          },
          "exits":{
            "west":"Elevator Hall",
            "east":"Split"
          }
        },

        "Split":{
          "description":"To your east, the creek splits off in two directions. Facing it, calm waters come from the left, and the right has a small waterfall and swimming hole. To the west, the creek continues downstream.",
          "entrances":{
            "east":"Main Creek",
            "northwest":"Swimming Hole",
            "southwest":"Shallows"
          },
          "exits":{
            "west":"Main Creek",
            "southeast":"Swimming Hole",
            "northeast":"Shallows"
          }
        },

        "Shallows":{
          "description":"You wade through the shallow creek. The bed of the creek is filled with small rocks.",
          "entrances":{
            "west":"Dad Pool",
            "northeast":"Split"
          },
          "exits":{
            "east":"Dad Pool",
            "southwest":"Split"
          },
          "features":{
            "Skipping Rocks":{
              "description":"You look at the rocks on the creek bed. They're pretty cool rocks. Very smooth and flat, too.",
              "actions":[
                "inspect",
                "skip a rock"
              ]
            }
          }
        },

        "Dad Pool":{
          "description":"As you make your way upstream, you notice parts of the creek get a bit deeper, creating nooks and crannies perfect for something to hide in. There's a bit of creek bank to relax on too.",
          "entrances":{
            "east":"Shallows"
          },
          "exits":{
            "west":"Shallows"
          },
          "features":{
            "Skipping Rocks":{
              "description":"You look at the rocks on the bottom of the creek. They're pretty cool rocks. Very smooth and flat, too.",
              "actions":[
                "inspect",
                "skip a rock"
              ]
            },
            "Big Rock":{
              "description":"You start to pry a large rock off the bottom... whoa! A crawdad is under it!",
              "actions":[
                "inspect"
              ],
              "hidden actions":[
                "grab the crawdad"
              ]
            },
            "Sword Spot":{
              "description":"sword"
            }
          }
        },

        "Swimming Hole":{
          "description":"You're at the swimming hole. If you're careful, you can inch around the steep slope, and get to where the water flows in. The bank looks unstable...",
          "entrances":{
            "southeast":"Split",
            "down":"Ledge 1",
            "out":"Pool"
          },
          "exits":{
            "northwest":"Split",
            "up":"Ledge 1"
          }
        },

        "Ledge 1":{
          "description":"You carefully shimmy on a narrow outcropping. You can feel the lose dirt slip under your feet. This is risky business.",
          "entrances":{
            "up":"Swimming Hole",
            "down":"Ledge 2"
          },
          "exits":{
            "up":"Ledge 2",
            "down":"Swimming Hole"
          }
        },

        "Ledge 2":{
          "description":"You keep inching across the steep face of the side of the creek. Be careful not to fall in, one misstep is all it takes...",
          "entrances":{
            "up":"Ledge 1"
          },
          "exits":{
            "up":"Top",
            "down":"Ledge 1"
          }
        },

        "Top":{
          "description":"You made it to the top! Holy cow, the pool is pretty far below you. You look around, but there's no other way up or forward. Guess it's time to go back, and there's only one way down...",
          "entrances":{
            "up":"Ledge 2"
          },
          "exits":{
          },
          "features":{
            "Ledge":{
              "description":"ledge for jumping in pool",
              "actions":[
                "jump"
              ]
            }
          }
        },

        "Pool":{
          "description":"SPLOOSH! You slam through the surface of the water, being pushed below the surface by the force of the waterfall. As you float back to the surface, you open your eyes underwater to see a message scratched on the rocky bottom: \"BRAVE:3889\".",
          "entrances":{
          },
          "exits":{
            "out":"Swimming Hole"
          }
        },

        "Elevator Hall":{
          "description":"You enter the elevator hallway.",
          "entrances":{
            "east":"Elevator",
            "west":"Main Creek"
          },
          "exits":{
            "west":"Elevator",
            "east":"Main Creek"
          }
        }
      }
    },

    "House Floor":{
      "class_":"normal",
      "number":9,
      "rooms":{

        "Entryway":{
          "description":"You walk into a entryway with a tiled floor. Each tile has a name on it, possibly from a donor that helped contribute to the construction of the building. To the north, a double sliding door, to the east, a door to the rest of the building, to the south, a larger room, possibly for meetings.",
          "entrances":{
            "east":"Elevator Hall",
            "west":"First Floor",
            "south":"Library",
            "north":"Foyer"
            
          },
          "exits":{
            "west":"Elevator Hall",
            "east":"First Floor",
            "north":"Library",
            "south":"Foyer"
          }
        },

        "Elevator Hall":{
          "description":"You enter the elevator hallway.",
          "entrances":{
            "east":"Elevator",
            "west":"Entryway"
          },
          "exits":{
            "west":"Elevator",
            "east":"Entryway"
          }
        },

        "Library":{
          "description":"The room has a large conference table surrounded by office chairs. Across the table is a trophy case with numerous awards. A plaque is placed next to a cat-shaped urn.",
          "entrances":{
            "north":"Entryway"
          },
          "exits":{
            "south":"Entryway"
          },
          "features":{
            "Urn":{
              "description":"The plaque reads: WE LOVE YOU, BEARCAT",
              "actions":[
                "inspect"
              ]
            }
          }
        },

        "Foyer":{
          "description":"A large space for meeting. The carpet is old, and reeks of beer. Somehow it feels... wet. The room is sparesly decorated and there's trash from a fast food place on the coffee table.",
          "entrances":{
            "south":"Entryway"
          },
          "exits":{
            "north":"Entryway"
          },
          "features":{
            "Piano":{
              "description":"An old piano. It doesn't work, and there's marks on top, as if people regularly sat on it.",
              "actions":[
                "inspect"
              ]
            },
            "Couch":{
              "description":"You plop on the couch. It's comfortable, but feels dirty. Maybe not best to sit here.",
              "actions":[
                "inspect"
              ]
            },
            "Ping Pong Table":{
              "description":"The ping pong table is folded up, but it looks broken anyway.",
              "actions":[
                "inspect"
              ]
            },
            "Window":{
              "description":"Through a window on the east side you can see a courtyard with a basketball hoop, a fire pit, and a pile of junk. Maybe there's a way down there?",
              "actions":[
                "inspect"
              ]
            }
          }
        },

        "First Floor":{
          "description":"You walk into a small hallway. To the south are some stairs. Most doors are locked, but at the end of the hall there's a room with \"Buttcrack\" written on the door.",
          "entrances":{
            "east":"Entryway",
            "upstairs":"Basement",
            "downstairs":"Second Floor",
            "out of buttcrack":"Buttcrack"
          },
          "exits":{
            "west":"Entryway",
            "downstairs":"Basement",
            "upstairs":"Second Floor",
            "to buttcrack":"Buttcrack"
          },
          "features":{
            "message board":{
              "description":"It's a calendar. Several events, including birthdays, are on it.",
              "actions":[
                "inspect"
              ]
            }
          }
        },

        "Basement":{
          "description":"You come into a stuffy basement. There's a kitchen, dining tables, elevated surfaces, party lights and a water machine. Cool air drafts in through a broken window, and large sheets of plywood cover most of the other windows.",
          "entrances":{
            "inside":"Courtyard",
            "downstairs":"First Floor"
          },
          "exits":{
            "upstairs":"First Floor",
            "outside":"Courtyard"
          },
          "features":{
            "Vending Machine":{
              "description":"It's a vending machine. A note is written on it: \"As long as there is Grape Fanta, there is hope\". There doesn't appear to be any Grape Fanta left in the machine.",
              "actions":[
                "inspect"
              ]
            },
            "Writing":{
              "description":"There's some writing scratched on the wall behind the water machine: \"If you can read this, you can read\". Clearly this places was inhabited by geniuses.",
              "actions":[
                "inspect"
              ]
            }
          },
          "items":{
            "Grape Fanta":{
              "description":"A can of Grape Fanta."
            }
          }
        },

        "Courtyard":{
          "description":"You walk into a courtyard with a basketball hoop, fire pit, and junk pile. Large tables with 4x8s over them stand on top of mounds of empty cans, and dice can be seen scattered around the yard.",
          "entrances":{
            "outside":"Basement"
          },
          "exits":{
            "inside":"Basement"
          },
          "features":{
            "Shovel":{
              "description":"shovel giver",
              "hidden actions":[
                "shovel"
              ]
            },
            "Dice":{
              "description":"throw dice",
              "actions":[
                "toss a die"
              ]
            },
            "Shovel Spot":{
              "description":"shovel"
            }
          }
        },

        "Second Floor":{
          "description":"You walk into a small hallway. There's an ATM, and the lights don't seem to be working. Most doors are locked, but at the end of the hall there's two rooms with \"Intensity\" and \"Cave\" written on the doors.",
          "entrances":{
            "downstairs":"Third Floor",
            "upstairs":"First Floor",
            "out of cave":"Cave",
            "out of intensity":"Intensity"
          },
          "exits":{
            "upstairs":"Third Floor",
            "downstairs":"First Floor",
            "to cave":"Cave",
            "to intensity":"Intensity"
          },
          "features":{
            "ATM":{
              "description":"An ATM buried in a closet filled with loose cables. There's no good reason this should be here.",
              "actions":[
                "inspect"
              ]
            }
          }
        },

        "Third Floor":{
          "description":"You walk into a small hallway. Most doors are locked, but at the end of the hall there's two rooms with \"Lovepit\" and \"Jungle\" written on the doors. There's a portico at the northwest end of hall, but you get the sense something is happening out there you don't want to interrupt...",
          "entrances":{
            "upstairs":"Second Floor",
            "out of lovepit":"Lovepit",
            "out of jungle":"Jungle"
          },
          "exits":{
            "northwest":"Portico",
            "downstairs":"Second Floor",
            "to jungle":"Jungle",
            "to lovepit":"Lovepit"
          },
          "features":{
            "Bathroom":{
              "description":"There's a bathroom, but going near it, you see it's swarming with flies, and smells disgusting. No reason to go in there.",
              "actions":[
                "inspect"
              ]
            }
          }
        },

        "Intensity":{
          "description":"There's a number of bunk beds, and a couch that's visibly stained. Something magic happened here a long time ago.",
          "entrances":{
            "to intensity":"Second Floor"
          },
          "exits":{
            "out of intensity":"Second Floor"
          }
        },

        "Cave":{
          "description":"The first part of the room is made of couchs, a shelf, and several fridges. There's no door on the hinge to the back, where there's two sets of bunk beds. Several names have been carved into the blue and white walls.",
          "entrances":{
            "to cave":"Second Floor"
          },
          "exits":{
            "out of cave":"Second Floor"
          }
        },

        "Jungle":{
          "description":"There's a big couch set up to look at a TV. The screen is cracked. The whole room smells like... a particular plant.",
          "entrances":{
            "to jungle":"Third Floor"
          },
          "exits":{
            "out of jungle":"Third Floor"
          }
        },

        "Lovepit":{
          "description":"The room has a number of beds, a couch, and several beanbags. Dirty magazines and old fast food are laid out on the coffee table.",
          "entrances":{
            "to lovepit":"Third Floor"
          },
          "exits":{
            "out of lovepit":"Third Floor"
          }
        },

        "Buttcrack":{
          "description":"Two rooms have their doors open. There's no furnishing, and the floors of both are covered in garbage.",
          "entrances":{
            "to buttcrack":"First Floor"
          },
          "exits":{
            "out of buttcrack":"First Floor"
          },
          "items":{
            "Nail Clippers":{
              "description":"A pair of rusty nail clippers."
            },
            "Hanger":{
              "description":"A plastic hanger."
            },
            "Necktie":{
              "description":"A dirty necktie. It's supposed to be grey, but it's covered in stains."
            },
            "Fan":{
              "description":"It's a fan. Wait, is it like a paper fan you hold in your hand, or an electric fan you put on your desk? Guess you can't tell from reading this, can you?"
            }
          }
        },

        "Portico":{
          "description":"There's something going on.",
          "entrances":{
          },
          "exits":{
          }
        }
      }
    },

    "Court":{
      "class_":"normal",
      "number":10,
      "rooms":{

        "Neighborhood":{
          "description":"As you walk through the door, you step outside into a residential neighborhood. The sun sets on mountains to the east. The house you walked out of is white with black shudders. In the driveway, a silver car is parked haphazardly. There's a basketball hoop on the street, and the mailbox in front of you seems to be at a slant, as if it was hit by something. What a nice place.",
          "entrances":{
            "east":"Elevator Hall"
          },
          "exits":{
            "west":"Elevator Hall"
          }
        },

        "Elevator Hall":{
          "description":"You enter the elevator hallway.",
          "entrances":{
            "east":"Elevator",
            "west":"Neighborhood"
          },
          "exits":{
            "west":"Elevator",
            "east":"Neighborhood"
          }
        }
      }
    },

    "Rock Pile":{
      "class_":"normal",
      "number":11,
      "rooms":{

        "Hole":{
          "description":"You seem to be in some kind of cave. You're stuck in a pit. The only light in the room comes from a hole about 10 feet up the wall. There's a pile of rocks beneath, but when you stand on them, you can't quite reach the hole.",
          "entrances":{
            "east":"Elevator Hall"
          },
          "exits":{
            "west":"Elevator Hall"
          },
          "features":{
            "Rock Pile":{
              "description":"A pile of rocks. It's almost tall enough to let you scale up the wall.",
              "actions":[
                "stack rocks on the pile"
              ]
            },
            "Crystal":{
              "description":"hidden crystal"
            }
          }
        },

        "Elevator Hall":{
          "description":"You enter the elevator hallway.",
          "entrances":{
            "east":"Elevator",
            "west":"Hole"
          },
          "exits":{
            "west":"Elevator",
            "east":"Hole"
          }
        }
      }
    },

    "Quiz Floor":{
      "class_":"normal",
      "number":12,
      "rooms":{

        "Quiz Room":{
          "description":"You walk out of the door and encounter a podium, with a mic faced toward you. On the wall in front of you is various questions to answer. Simply use SPEAK to say the answer out loud. No harm in guessing.",
          "entrances":{
            "east":"Elevator Hall"
          },
          "exits":{
            "west":"Elevator Hall"
          },
          "features":{
            "Liquid Question":{
              "description":"This liquid is vital to human life. People drink it all the time. What is it?",
              "actions":[
                "inspect"
              ]
            },
            "GOAT question":{
              "description":"Who is the Melee GOAT? (hint: if you think it's armada, you're a square)",
              "actions":[
                "inspect"
              ]
            },
            "Koi Question":{
              "description":"How much money was the most expensive koi ever sold worth? Pick from the following.\n112k\n55k\n871k\n1.8m",
              "actions":[
                "inspect"
              ]
            },
            "SAP Question":{
              "description":"In super auto pets, which pet puts two Milk items in the shop when bought?",
              "actions":[
                "inspect"
              ]
            },
            "Panda Question":{
              "description":"At Panda Express, there is only one entree you should ever order. What is it?",
              "actions":[
                "inspect"
              ]
            },
            "Listener":{
              "description":"",
              "hidden actions":[
                "Mango",
                "Beer",
                "Orange Chicken",
                "1.8m",
                "Cow"
              ]
            }
          }
        },

        "Elevator Hall":{
          "description":"You enter the elevator hallway.",
          "entrances":{
            "east":"Elevator",
            "west":"Quiz Room"
          },
          "exits":{
            "west":"Elevator",
            "east":"Quiz Room"
          }
        }
      }
    },

    "Blank Floor":{
      "class_":"normal",
      "number":13,
      "rooms":{

        "Room":{
          "description":"alright. honestly, gonna level with you here. my eyes were a little bigger than my stomach on this one. I thought I was gonna be able to make 100 floors. how insane is that. 100? each designed with some interaction with some other? sheesh. forget it. that being said, feel like I did a pretty ok job all things considered. I'm still churning these things out as best I can, but I can only do so much. so I'm taking a break and making this one easy. there's supposed to be a pepper shaker here, so if there isn't, someone took it already.",
          "entrances":{
            "east":"Elevator Hall"
          },
          "exits":{
            "west":"Elevator Hall"
          },
          "items":{
            "Pepper Shaker":{
              "description":"It's full of pepper."
            }
          }
        },

        "Elevator Hall":{
          "description":"You enter the elevator hallway.",
          "entrances":{
            "east":"Elevator",
            "west":"Room"
          },
          "exits":{
            "west":"Elevator",
            "east":"Room"
          }
        }
      }
    },

    "Coast Floor":{
      "class_":"normal",
      "number":14,
      "rooms":{
  
        "Main Room":{
          "description":"You step into a cave made of beautiful stone. The color of the rocks fade from pink to yellow to red to orange. To the north, a seasalt breeze comes in from an opening in the cave. To the south, the cave gets dark.",
          "entrances":{
            "east":"Elevator Hall",
            "south":"Mouth",
            "north":"Maze 1"
          },
          "exits":{
            "west":"Elevator Hall",
            "north":"Mouth",
            "south":"Maze 1"
          }
        },

        "Maze 1":{
          "description":"There's a stack of 3 stones. Each stone is cut from the same gorgeous rock the cave is made of, but perfectly polished to be round. Funny... feels like you've been here before.",
          "entrances":{
            "south":"Main Room",
            "north":"Maze 9",
            "southwest":"Maze 5",
            "west":"Maze 4",
            "northwest":"Maze 2"
          },
          "exits":{
            "north":"Main Room",
            "east":"Maze 6",
            "west":"Maze 2"
          }
        },

        "Maze 2":{
          "description":"There's a stack of 2 stones. You're almost certain you've been here before.",
          "entrances":{
            "east":"Maze 8",
            "south":"Maze 3",
            "west":"Maze 1"
          },
          "exits":{
            "west":"Maze 5",
            "northwest":"Maze 1"
          }
        },

        "Maze 3":{
          "description":"There's 3 stones all set next to each other. You can't remember which direction you came from.",
          "entrances":{
            "west":"Maze 6"
          },
          "exits":{
            "south":"Maze 2",
            "northwest":"Maze 4"
          }
        },

        "Maze 4":{
          "description":"There's a stack of 4 stones. It's a dead end.",
          "entrances":{
            "west":"Maze 8",
            "northwest":"Maze 3"
          },
          "exits":{
            "west":"Maze 1"
          }
        },

        "Maze 5":{
          "description":"There's a stack of 2 stones, and a stack of 3 next to it. You feel as if you've lost your sense of direction.",
          "entrances":{
            "west":"Maze 2"
          },
          "exits":{
            "north":"Maze 7",
            "southwest":"Maze 1"
          }
        },

        "Maze 6":{
          "description":"6 rocks are on the ground in a circle. This looks too familiar... yet it's also a dead end.",
          "entrances":{
            "north":"Maze 8",
            "northeast":"Maze 7",
            "east":"Maze 1"
          },
          "exits":{
            "west":"Maze 3"
          }
        },

        "Maze 7":{
          "description":"There's a stack of 4 and 3 stones. The orange and pink hues of the fall can faintly be seen.",
          "entrances":{
            "north":"Maze 5"
          },
          "exits":{
            "northeast":"Maze 6",
            "south":"Maze 8"
          }
        },

        "Maze 8":{
          "description":"There's 2 stacks of 4 stones each. Both stacks are the same height. The room is made of the same stone material.",
          "entrances":{
            "south":"Maze 7"
          },
          "exits":{
            "north":"Maze 6",
            "east":"Maze 2",
            "west":"Maze 4",
            "south":"Maze 9"
          }
        },

        "Maze 9":{
          "description":"This room feels odd. There's a message carved into the stone wall.",
          "entrances":{
            "south":"Maze 8"
          },
          "exits":{
            "north":"Maze 1"
          },
          "features":{
          
            "Wall Carving":{
              "description":"The carving in the stone reads: \"TACTICS:2487\".",
              "actions":[
                  "inspect"
              ]
            }
          }
        },

        "Mouth":{
          "description":"The mouth of the cave gives way to a 50ft drop into the ocean. The sun is setting, and the water shimmers beautifully.",
          "entrances":{
            "north":"Elevator Hall"
          },
          "exits":{
            "south":"Elevator Hall"
          },
          "features":{
            
            "Feature Name":{
              "description":"description of feature",
              "actions":[
                  "name of action (needs to already exist in the code)"
              ],
              "hidden actions":[
                "see above but not listed initially"
              ]
            }
          }
        },
  
        "Elevator Hall":{
          "description":"You enter the elevator hallway.",
          "entrances":{
            "east":"Elevator",
            "west":"Main Room"
          },
          "exits":{
            "west":"Elevator",
            "east":"Main Room"
          }
        }
      }
    },

    "Vault":{
      "class_":"normal",
      "number":15,
      "rooms":{
  
        "Ability Room":{
          "description":"You've come to a large vault. Over the door is written \"ABILITY\".",
          "entrances":{
            "east":"Elevator Hall",
            "west":"Spirits Room"
          },
          "exits":{
            "west":"Elevator Hall"
          },
          "features":{
            
            "Listener":{
              "description":"listener",
              "hidden actions":[
                "6430"
              ]
            }
          }
        },
        
        "Spirits Room":{
          "description":"You've come to a large vault. Over the door is written \"SPIRITS\".",
          "entrances":{
            "east":"Ability Room"
          },
          "exits":{
            "west":"Ability Room"
          },
          "features":{
            
            "Listener":{
              "description":"listener",
              "hidden actions":[
                "5007"
              ]
            }
          }
        },

        "Knowledge Room":{
          "description":"You've come to a large vault. Over the door is written \"KNOWLEDGE\".",
          "entrances":{
            "east":"Spirits Room"
          },
          "exits":{
            "west":"Spirits Room"
          },
          "features":{
            
            "Listener":{
              "description":"listener",
              "hidden actions":[
                "1349"
              ]
            }
          }
        },

        "Guts Room":{
          "description":"You've come to a large vault. Over the door is written \"GUTS\".",
          "entrances":{
            "east":"Knowledge Room"
          },
          "exits":{
            "west":"Knowledge Room"
          },
          "features":{
            
            "Listener":{
              "description":"listener",
              "hidden actions":[
                "3295"
              ]
            }
          }
        },

        "Tactics Room":{
          "description":"You've come to a large vault. Over the door is written \"TACTICS\".",
          "entrances":{
            "east":"Guts Room"
          },
          "exits":{
            "west":"Guts Room"
          },
          "features":{
            
            "Listener":{
              "description":"listener",
              "hidden actions":[
                "2487"
              ]
            }
          }
        },

        "Luck Room":{
          "description":"You've come to a large vault. Over the door is written \"LUCK\".",
          "entrances":{
            "east":"Tactics Room"
          },
          "exits":{
            "west":"Tactics Room"
          },
          "features":{
            
            "Listener":{
              "description":"listener",
              "hidden actions":[
                "2861"
              ]
            }
          }
        },

        "Brave Room":{
          "description":"You've come to a large vault. Over the door is written \"BRAVE\".",
          "entrances":{
            "east":"Luck Room"
          },
          "exits":{
            "west":"Luck Room"
          },
          "features":{
            
            "Listener":{
              "description":"listener",
              "hidden actions":[
                "3889"
              ]
            }
          }
        },

        "Finale":{
          "description":"The last room. All that's there is a phone.",
          "entrances":{
            "east":"Brave Room"
          },
          "exits":{
          },
          "features":{
            
            "Phone":{
              "description":"It's an old rotary phone. Next to the phone is a note with a phone number on it. Give it a ring. Be sure to tell him you've made it.[your number here]",
              "actions":[
                "inspect"
              ]
            }
          }
        },

        "Elevator Hall":{
          "description":"You enter the elevator hallway.",
          "entrances":{
            "east":"Elevator",
            "west":"Ability Room"
          },
          "exits":{
            "west":"Elevator",
            "east":"Ability Room"
          }
        }
      }
    }
    
    
}
  